## SUM and COUNT

In [2]:
from query import query

#### **1.Total world population**

Show the total population of the world.

In [9]:
query("SELECT SUM(population) 'World Population' FROM world;")

   world population
0      7.118633e+09

#### **2.List of continents**

List all the continents - just once each.

In [5]:
query("SELECT distinct(continent) FROM world;")

       continent
0         Africa
1           Asia
2      Caribbean
3        Eurasia
4         Europe
5  North America
6        Oceania
7  South America

#### **3.GDP of Africa**

Give the total GDP of Africa

In [10]:
query("SELECT sum(gdp) 'GDP of Africa' FROM world WHERE continent = 'Africa';")

   GDP of Africa
0   1.811788e+12

#### **4.Count the big countries**

How many countries have an area of at least 1000000

In [11]:
query("""
        SELECT count(name) 'Big Countries' FROM world WHERE area >= 1000000;
    """)

   Big Countries
0             29

#### **5.Baltic states population**

What is the total population of ('Estonia', 'Latvia', 'Lithuania')

In [12]:
query("""
    SELECT SUM(population) 'Baltic States Population' FROM world WHERE name IN  ('Estonia', 'Latvia', 'Lithuania');
 """)

   Baltic States Population
0                 6251750.0

#### **6.Counting the countries of each continent**

For each continent show the continent and number of countries.

In [4]:
query("SELECT continent,count(name) FROM world GROUP BY continent;")

       continent  count(name)
0         Africa           53
1           Asia           47
2      Caribbean           11
3        Eurasia            2
4         Europe           44
5  North America           11
6        Oceania           14
7  South America           13

#### **7.Counting big countries in each continent**

For each continent show the continent and number of countries with populations of at least 10 million.

In [7]:
query("""
     SELECT continent,count(name) FROM world 
     WHERE population >= 10000000 
     GROUP BY continent;
""")

       continent  count(name)
0         Africa           29
1           Asia           26
2      Caribbean            2
3        Eurasia            1
4         Europe           14
5  North America            4
6        Oceania            1
7  South America            8

#### **8.Counting big continents**

List the continents that have a total population of at least 100 million.

In [4]:
query("""
    SELECT continent FROM world x 
    WHERE (SELECT SUM(population) 
    FROM world y WHERE x.continent=y.continent) >= 10000000
    GROUP BY continent;
""")

       continent
0         Africa
1           Asia
2      Caribbean
3        Eurasia
4         Europe
5  North America
6        Oceania
7  South America